const siid_item=[
[	"11200",	"男A三級跳遠(決賽)",	"RCFIE"],
[	"11180",	"男A跳高(決賽)",	"RCFJH"],
[	"11190",	"男A跳遠(決賽)",	"RCFIE"],
[	"11220",	"男A鉛球(決賽)",	"RCFIE"],
[	"12180",	"男B跳高(決賽)",	"RCFJH"],
[	"12190",	"男B跳遠(決賽)",	"RCFIE"],
[	"12220",	"男B鉛球(決賽)",	"RCFIE"],
[	"13180",	"男C跳高(決賽)",	"RCFJH"],
[	"13220",	"男C鉛球(決賽)",	"RCFIE"],
[	"13190",	"男C跳遠(決賽)",	"RCFIE"],
[	"21180",	"女A跳高(決賽)",	"RCFJH"],
[	"21190",	"女A跳遠(決賽)",	"RCFIE"],
[	"21220",	"女A鉛球(決賽)",	"RCFIE"],
[	"22180",	"女B跳高(決賽)",	"RCFJH"],
[	"22190",	"女B跳遠(決賽)",	"RCFIE"],
[	"22220",	"女B鉛球(決賽)",	"RCFIE"],
[	"23180",	"女C跳高(決賽)",	"RCFJH"],
[	"23220",	"女C鉛球(決賽)",	"RCFIE"],
[	"23190",	"女C跳遠(決賽)",	"RCFIE"],
[	"11030",	"男A100M(初賽)",	"RC1"],
[	"11032",	"男A100M(決賽)",	"RC2"],
[	"11040",	"男A200M(初賽)",	"RC1"],
[	"11041",	"男A200M(決賽)",	"RC2"],
[	"12030",	"男B100M(初賽)",	"RC1"],
[	"12032",	"男B100M(決賽)",	"RC2"],
[	"12040",	"男B200M(初賽)",	"RC1"],
[	"12041",	"男B200M(決賽)",	"RC2"],
[	"13030",	"男C100M(初賽)",	"RC1"],
[	"13032",	"男C100M(決賽)",	"RC2"],
[	"13040",	"男C200M(初賽)",	"RC1"],
[	"13041",	"男C200M(決賽)",	"RC2"],
[	"21030",	"女A100M(初賽)",	"RC1"],
[	"21032",	"女A100M(決賽)",	"RC2"],
[	"21040",	"女A200M(初賽)",	"RC1"],
[	"21041",	"女A200M(決賽)",	"RC2"],
[	"22030",	"女B100M(初賽)",	"RC1"],
[	"22032",	"女B100M(決賽)",	"RC2"],
[	"22040",	"女B200M(初賽)",	"RC1"],
[	"22041",	"女B200M(決賽)",	"RC2"],
[	"23030",	"女C100M(初賽)",	"RC1"],
[	"23032",	"女C100M(決賽)",	"RC2"],
[	"23040",	"女C200M(初賽)",	"RC1"],
[	"23041",	"女C200M(決賽)",	"RC2"],
[	"11050",	"男A400M(決賽)",	"RC2"],
[	"12050",	"男B400M(決賽)",	"RC2"],
[	"21050",	"女A400M(決賽)",	"RC2"],
[	"22050",	"女B400M(決賽)",	"RC2"],
[	"11060",	"男A800M(決賽)",	"RC5"],
[	"11080",	"男A1500M(決賽)",	"RC5"],
[	"11100",	"男A5000M(決賽)",	"RC5"],
[	"12060",	"男B800M(決賽)",	"RC5"],
[	"12080",	"男B1500M(決賽)",	"RC5"],
[	"12090",	"男B3000M(決賽)",	"RC5"],
[	"13080",	"男C1500M(決賽)",	"RC5"],
[	"21060",	"女A800M(決賽)",	"RC5"],
[	"21080",	"女A1500M(決賽)",	"RC5"],
[	"22060",	"女B800M(決賽)",	"RC5"],
[	"22080",	"女B1500M(決賽)",	"RC5"],
[	"23080",	"女C1500M(決賽)",	"RC5"]];
function item2siid(x)
{
    x=x.replace("_tmp.pdf","").replace("_pub.pdf","").replace(".pdf","").replace("賽果","").replace("名單","");
    for(let i=0;i<siid_item.length;i++)
    {
        if(siid_item[i][1]==x)
        {
            return siid_item[i];
        }
    }
    return null;
}
module.exports = {
item2siid:item2siid
}